awardbjj/app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    filtered = Event.where("name LIKE ?", "%#{params[:filter]}%").all
    @pagy, @events = pagy(filtered.all, items: 10)

INSERT INTO "events" ("name", "start_at", "end_at", "location", "game_type", "description", "organizer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    if @event.save

UPDATE "events" SET "start_at" = $1, "end_at" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["start_at", "2024-01-24 09:34:43"], ["end_at", "2024-01-25 09:34:43"], ["updated_at", "2024-01-25 09:36:52.226122"], ["id", 190150649]]
---
  def update
    if @event.update(event_params)