awardbjj/app/models/event.rb

    def create_brackets_and_weightclasses
      weight_classes_data = (self.game_type == 'gi') ? WEIGHT_CLASSES_DATA_GI : WEIGHT_CLASSES_DATA_NOGI

      BELTS.each do |belt|
        weight_classes_data.each do |weight_class, genders|
          genders.each do |gender, age_groups|
            age_groups.each do |age_group, weight|
              next if age_group == 'Juvenile' && (belt == 'Brown' || belt == 'Black')

              bracket = brackets.create() # automatically creates bracket ties it to an event
              weightclass = bracket.create_weightclass(age: age_group, sex: gender, belt: belt, weight: weight)
---
INSERT INTO "brackets" ("event_id", "created_at", "updated_at", "first_place_id", "second_place_id", "third_place_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_id", 308029008], ["created_at", "2024-01-29 16:40:45.758283"], ["updated_at", "2024-01-29 16:40:45.758283"], ["first_place_id", nil], ["second_place_id", nil], ["third_place_id", nil]]
INSERT INTO "weightclasses" ("bracket_id", "age", "belt", "sex", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["bracket_id", 4], ["age", "Adult"], ["belt", "White"], ["sex", "Male"], ["weight", 55.5], ["created_at", "2024-01-29 16:40:45.766813"], ["updated_at", "2024-01-29 16:40:45.766813"]]