awardbjj/app/models/event.rb

  def create_matches
    brackets.each do |bracket|
      if bracket.registrations.count > 0
        bracket.create_matches
---
INSERT INTO "brackets" ("event_id", "created_at", "updated_at", "first_place_id", "second_place_id", "third_place_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_id", 308029007], ["created_at", "2024-01-29 14:29:02.824528"], ["updated_at", "2024-01-29 14:29:02.824528"], ["first_place_id", nil], ["second_place_id", nil], ["third_place_id", nil]]