awardbjj/app/views/brackets/_bracket.html.erb

        <div class="">
            <% bracket.registrations.each do |registration| %>
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."bracket_id" = $1  [["bracket_id", 512793945]]