awardbjj/app/views/users/index.html.erb

<% @users = User.all %>
---
SELECT "users".* FROM "users"